Repository: minios-linux/minios-kernel-manager
Catalog: po/*.po
Languages: es, pt

source: No live system changes directory found, using /tmp anyway
es: No se encontró el directorio de cambios del sistema en vivo, usando /tmp de todos modos

source: No initramfs builder found. Please install minios-dracut package or ensure mkinitrfs is available.
es: No se encontró constructor de initramfs. Por favor, instale el paquete minios-dracut o asegúrese de que mkinitrfs esté disponible.

source: Failed to detect initramfs builder: {}
es: Fallo al detectar el constructor de initramfs: {}

source: mkdracut not found - please install minios-dracut package
es: mkdracut no encontrado - por favor instale el paquete minios-dracut

source: mkdracut failed with return code {code}
es: mkdracut falló con el código de retorno {code}

source: Failed to generate initramfs with dracut: {}
es: Fallo al generar initramfs con dracut: {}

source: Dracut succeeded but output file not found: {}
es: Dracut finalizó correctamente pero no se encontró el archivo de salida: {}
