Repository: minios-linux/minios-kernel-manager
Catalog: po/*.po
Languages: es, pt

source: vmlinuz for kernel {kernel_version} not found
es: vmlinuz para el kernel {kernel_version} no encontrado
pt: vmlinuz para o kernel {kernel_version} não encontrado

source: temp_dir is required and must exist for SquashFS creation
es: temp_dir es requerido y debe existir para la creación de SquashFS
pt: temp_dir é obrigatório e deve existir para a criação de SquashFS

source: Kernel modules not found in extracted deb package for kernel {kernel_version}
es: Módulos del kernel no encontrados en el paquete deb extraído para el kernel {kernel_version}
pt: Módulos do kernel não encontrados no pacote deb extraído para o kernel {kernel_version}

source: Using system modules base: {base}
pt: A usar base de módulos do sistema: {base}

source: Generating module dependencies for SquashFS
pt: A gerar dependências de módulos para SquashFS

source: Critical depmod error: {}
es: Error crítico de depmod: {}
pt: Erro crítico de depmod: {}

source: depmod failed: {}
pt: depmod falhou: {}

source: Module dependencies generated successfully
pt: Dependências de módulos geradas com sucesso

source: Failed to generate module dependencies: {}
pt: Falha ao gerar dependências de módulos: {}

source: Using extracted deb modules with structure: {path}
pt: A utilizar módulos deb extraídos com a estrutura: {path}

source: mksquashfs version detected: {major}.{minor}, no-strip support: {use_no_strip}
pt: Versão do mksquashfs detetada: {major}.{minor}, suporte no-strip: {use_no_strip}

source: Could not parse version from: {version_line}
pt: Não foi possível analisar a versão de: {version_line}

source: No version line found in output
pt: Nenhuma linha de versão encontrada na saída

source: mksquashfs version check failed: {error}
pt: A verificação da versão do mksquashfs falhou: {error}

source: mksquashfs command not found. Please install squashfs-tools package.
es: Comando mksquashfs no encontrado. Por favor instale el paquete squashfs-tools.
pt: Comando mksquashfs não encontrado. Por favor, instale o pacote squashfs-tools.

source: Starting SquashFS compression with {compression}...
pt: A iniciar a compressão SquashFS com {compression}...

source: mksquashfs command: {command}
pt: Comando mksquashfs: {command}

source: Failed to create SquashFS image
es: Fallo al crear la imagen SquashFS
pt: Falha ao criar imagem SquashFS

source: SquashFS image completed: {path}
pt: Imagem SquashFS concluída: {path}

source: mkinitrfs not found - this tool requires MiniOS live environment
es: mkinitrfs no encontrado - esta herramienta requiere el entorno en vivo de MiniOS
pt: mkinitrfs não encontrado - esta ferramenta requer o ambiente MiniOS live

source: Removed existing symlink: {}
pt: Symlink existente removido: {}

source: Using existing modules directory: {}
pt: A utilizar a pasta de módulos existente: {}

source: Created temporary symlink: {system_path} -> {extracted_path}
pt: Symlink temporário criado: {system_path} -> {extracted_path}

source: Generating module dependencies for initramfs
pt: A gerar dependências de módulos para initramfs

source: Using custom temporary directory for initramfs: {}
pt: A utilizar pasta temporária personalizada para initramfs: {}

source: Starting initramfs generation...
pt: A iniciar a geração do initramfs...

source: mkinitrfs failed with return code {code}
es: mkinitrfs falló con el código de retorno {code}
pt: mkinitrfs falhou com código de retorno {code}

source: mkinitrfs failed: {error}
es: mkinitrfs falló: {error}
pt: mkinitrfs falhou: {error}

source: mkinitrfs error: {error}
es: Error de mkinitrfs: {error}
pt: erro mkinitrfs: {error}

source: mkinitrfs output was:
pt: A saída do mkinitrfs foi:

source: mkinitrfs did not return valid initramfs path
es: mkinitrfs no devolvió una ruta de initramfs válida
pt: mkinitrfs não retornou um caminho initramfs válido

source: Copying initramfs from {path}
pt: A copiar initramfs de {path}

source: Initramfs created: {path}
pt: Initramfs criado: {path}

source: Removed temporary symlink: {path}
pt: Symlink temporário removido: {path}

source: Cleaning up on interruption: {}
es: Limpiando en caso de interrupción: {}
pt: A limpar após interrupção: {}

source: Temporary directory cleaned up
es: Directorio temporal limpiado
pt: Pasta temporária limpa

source: Failed to clean temporary directory: {}
es: Fallo al limpiar el directorio temporal: {}
pt: Falha ao limpar a pasta temporária: {}

source: Received {} - cleaning up...
es: Recibido {} - limpiando...
pt: Recebido {} - a limpar...

source: Created output directory: {}
es: Directorio de salida creado: {}
pt: Pasta de saída criada: {}

source: Failed to create output directory '{}': {}
es: Fallo al crear el directorio de salida '{}': {}
pt: Falha ao criar a pasta de saída '{}': {}

source: Output directory '{}' is not writable
es: El directorio de salida '{}' no es escribible
pt: A pasta de saída '{}' não é gravável

source: Created temporary directory: {}
es: Directorio temporal creado: {}
pt: Pasta temporária criada: {}

source: Downloading kernel package {}
es: Descargando paquete del kernel {}
pt: A transferir o pacote do kernel {}

source: Processing manual package {}
es: Procesando paquete manual {}
pt: A processar pacote manual {}

source: Download completed
es: Descarga completada
pt: Transferência concluída

source: Extracting package
es: Extrayendo paquete
pt: A extrair pacote

source: Preparing kernel modules
es: Preparando módulos del kernel
pt: A preparar módulos do kernel

source: Copying kernel files
es: Copiando archivos del kernel
pt: A copiar ficheiros do kernel

source: Creating SquashFS image
es: Creando imagen SquashFS
pt: A criar imagem SquashFS

source: Generating initramfs
es: Generando initramfs
pt: A gerar initramfs

source: Installing to kernel repository
es: Instalando en el repositorio de kernels
pt: A instalar no repositório de kernels

source: Finalizing installation
es: Finalizando instalación
pt: A finalizar instalação

source: Kernel packaging completed successfully!
es: ¡Empaquetado del kernel completado exitosamente!
pt: Empacotamento do kernel concluído com sucesso!

source: MiniOS directory not found
es: Directorio de MiniOS no encontrado
pt: Pasta MiniOS não encontrada

source: Available kernels
es: Kernels disponibles
pt: Kernels disponíveis

source: active
es: activo
pt: ativo

source: Currently active kernel
es: Kernel actualmente activo
pt: Kernel atualmente ativo

source: No currently active kernel found
es: No se encontró ningún kernel actualmente activo
pt: Nenhum kernel atualmente ativo encontrado

source: Found MiniOS directory: {}
es: Directorio de MiniOS encontrado: {}
pt: Pasta MiniOS encontrada: {}

source: Currently active kernel: {}
es: Kernel actualmente activo: {}
pt: Kernel atualmente ativo: {}

source: Kernel {} is already active
es: El kernel {} ya está activo
pt: O kernel {} já está ativo

source: Activating kernel {}...
es: Activando kernel {}...
pt: A ativar o kernel {}...

source: Kernel {} activated successfully!
es: ¡Kernel {} activado exitosamente!
pt: Kernel {} ativado com sucesso!

source: Failed to activate kernel {}
es: Fallo al activar el kernel {}
pt: Falha ao ativar o kernel {}

source: Kernel {} not found
es: Kernel {} no encontrado
pt: Kernel {} não encontrado

source: No active kernel found
es: No se encontró ningún kernel activo
pt: Nenhum kernel ativo encontrado

source: Active
es: Activo
pt: Ativo

source: Available
es: Disponible
pt: Disponível

source: Status
es: Estado
pt: Estado

source: MiniOS path
es: Ruta de MiniOS
pt: Caminho MiniOS

source: Current active kernel
es: Kernel activo actual
pt: Kernel ativo atual

source: Total available kernels
es: Total de kernels disponibles
pt: Total de kernels disponíveis

source: Directory is on a SquashFS filesystem (read-only)
es: El directorio está en un sistema de archivos SquashFS (solo lectura)
pt: A pasta está num sistema de ficheiros SquashFS (só de leitura)

source: Permission denied: {}
es: Permiso denegado: {}
pt: Permissão negada: {}

source: Error checking directory: {}
es: Error al verificar el directorio: {}
pt: Erro ao verificar a pasta: {}

source: Filesystem type
es: Tipo de sistema de archivos
pt: Tipo de sistema de ficheiros

source: Writable
es: Escribible
pt: Gravável

source: Read-only
es: Solo lectura
pt: Só de leitura

source: Reason
es: Razón
pt: Motivo

source: Kernel {} deleted successfully
es: Kernel {} eliminado exitosamente
pt: Kernel {} eliminado com sucesso

source: Failed to delete kernel {}
es: Fallo al eliminar el kernel {}
pt: Falha ao eliminar o kernel {}

source: This tool requires root privileges. Please run with sudo or through pkexec.
es: Esta herramienta requiere privilegios de root. Por favor, ejecute con sudo o mediante pkexec.
pt: Esta ferramenta requer privilégios de root. Por favor, execute com sudo ou através do pkexec.

source: MiniOS Kernel Manager CLI
es: CLI del Gestor de Kernels de MiniOS
pt: CLI do Gestor de Kernels do MiniOS

source: Output in JSON format
es: Salida en formato JSON
pt: Saída em formato JSON

source: Available commands
es: Comandos disponibles
pt: Comandos disponíveis

source: Package a kernel
es: Empaquetar un kernel
pt: Empacotar um kernel

source: Name of the kernel package in the repository
es: Nombre del paquete del kernel en el repositorio
pt: Nome do pacote do kernel no repositório

source: Path to the kernel .deb package
es: Ruta al paquete .deb del kernel
pt: Caminho para o pacote .deb do kernel

source: Directory to save the packaged kernel files
es: Directorio para guardar los archivos del kernel empaquetado
pt: Pasta para guardar os ficheiros do kernel empacotado

source: Compression method for SquashFS
es: Método de compresión para SquashFS
pt: Método de compressão para SquashFS

source: Custom temporary directory (must have at least 1024MB free space)
es: Directorio temporal personalizado (debe tener al menos 1024MB de espacio libre)
pt: Pasta temporária personalizada (deve ter pelo menos 1024MB de espaço livre)

source: Force package lists update if outdated
es: Forzar actualización de listas de paquetes si están desactualizadas
pt: Forçar atualização das listas de pacotes se desatualizadas

source: List available kernels
es: Listar kernels disponibles
pt: Listar kernels disponíveis

source: Activate a kernel
es: Activar un kernel
pt: Ativar um kernel

source: Kernel version to activate
es: Versión del kernel a activar
pt: Versão do kernel a ativar

source: Show kernel information
es: Mostrar información del kernel
pt: Mostrar informação do kernel

source: Kernel version to get info about (current if not specified)
es: Versión del kernel para obtener información (actual si no se especifica)
pt: Versão do kernel para obter informação (atual se não especificado)

source: Check MiniOS directory status
es: Comprobar el estado del directorio de MiniOS
pt: Verificar o estado da pasta MiniOS

source: Delete a packaged kernel
es: Eliminar un kernel empaquetado
pt: Eliminar um kernel empacotado

source: Kernel version to delete
es: Versión del kernel a eliminar
pt: Versão do kernel a eliminar

source: Updated SYSLINUX config
pt: Configuração do SYSLINUX atualizada

source: Error updating syslinux config: {error}
pt: Erro ao atualizar a configuração do syslinux: {error}

source: No GRUB configuration files found
pt: Nenhum ficheiro de configuração do GRUB encontrado

source: Failed to update GRUB config {}: {}
pt: Falha ao atualizar a configuração do GRUB {}: {}

source: Updated GRUB configs: {}
pt: Configurações do GRUB atualizadas: {}

source: No GRUB config changes needed
pt: Nenhuma alteração na configuração do GRUB é necessária

source: Error updating grub configs: {error}
pt: Erro ao atualizar as configurações do GRUB: {error}

source: Updating package lists...
es: Actualizando listas de paquetes...
pt: Atualizando listas de pacotes...

source: Package lists updated
es: Listas de paquetes actualizadas
pt: Listas de pacotes atualizadas

source: Failed to update package lists: {}
es: Fallo al actualizar las listas de paquetes: {}
pt: Falha ao atualizar as listas de pacotes: {}

source: Error updating package lists: {}
es: Error al actualizar las listas de paquetes: {error}
pt: Erro ao atualizar as listas de pacotes: {error}

source: Package database is outdated
es: Base de datos de paquetes desactualizada
pt: Banco de dados de pacotes desatualizado

source: Run 'apt update' or use --force-update
es: Ejecute 'apt update' o use --force-update
pt: Execute 'apt update' ou use --force-update

source: Downloading {package_name} from repository...
pt: A transferir {package_name} do repositório...

source: Download completed successfully
pt: Transferência concluída com sucesso

source: Found package file: {filename}
pt: Ficheiro de pacote encontrado: {filename}

source: Extracting package contents...
pt: A extrair o conteúdo do pacote...

source: Package extracted successfully
pt: Pacote extraído com sucesso

source: Removing existing kernel modules for {kernel_version}
pt: A remover módulos do kernel existentes para {kernel_version}

source: Error reading modules directory: {error}
pt: Erro ao ler a pasta de módulos: {error}

source: Kernel modules for {kernel_version} not found in package
es: Módulos del kernel para {kernel_version} no encontrados en el paquete
pt: Módulos do kernel para {kernel_version} não encontrados no pacote

source: Installing kernel modules to {target_path}
pt: A instalar módulos do kernel em {target_path}

source: Building module dependencies
pt: A construir dependências de módulos

source: MiniOS directory is writable
es: El directorio de MiniOS es escribible
pt: A pasta MiniOS é gravável

source: MiniOS directory is read-only
es: El directorio de MiniOS es de solo lectura
pt: A pasta MiniOS é só de leitura

source: Manage Kernels
es: Administrar Kernels
pt: Gerir Kernels

source: Package Kernel
es: Empaquetar Kernel
pt: Empacotar Kernel

source: Select a packaged kernel to activate or delete:
es: Seleccione un kernel empaquetado para activar o eliminar:
pt: Selecione um kernel empacotado para ativar ou apagar:

source: Activating kernel...
es: Activando kernel...
pt: A ativar o kernel...

source: Manual Package
es: Paquete Manual
pt: Pacote Manual

source: Repository
es: Repositorio
pt: Repositório

source: SquashFS Compression:
es: Compresión SquashFS:
pt: Compressão SquashFS:

source: No file selected
es: Ningún archivo seleccionado
pt: Nenhum ficheiro selecionado

source: Browse...
es: Examinar...
pt: Procurar...

source: Package Information:
es: Información del Paquete:
pt: Informação do Pacote:

source: Available Kernels:
es: Kernels Disponibles:
pt: Kernels Disponíveis:

source: Package kernel and add to repository
es: Empaquetar kernel y añadir al repositorio
pt: Empacotar kernel e adicionar ao repositório

source: Please select a kernel first
es: Por favor, seleccione un kernel primero
pt: Por favor, selecione um kernel primeiro

source: Build in progress...
es: Construcción en progreso...
pt: Compilação em andamento...

source: No kernels packaged
pt: Nenhum kernel empacotado

source: Package a kernel first using the Package Kernel tab
pt: Empacote um kernel primeiro utilizando a aba 'Empacotar Kernel'

source: ACTIVE
es: ACTIVO
pt: ATIVO

source: AVAILABLE
es: DISPONIBLE
pt: DISPONÍVEL

source: RUNNING
es: EN EJECUCIÓN
pt: EM EXECUÇÃO

source: Please select a kernel to activate
es: Por favor, seleccione un kernel para activar
pt: Por favor, selecione um kernel para ativar

source: MiniOS directory is not writable
es: El directorio de MiniOS no es escribible
pt: A pasta MiniOS não é gravável

source: Activate Kernel
es: Activar Kernel
pt: Ativar Kernel

source: Are you sure you want to activate kernel {}? This will deactivate the current kernel and update the bootloader configuration.
es: ¿Está seguro de que desea activar el kernel {}? Esto desactivará el kernel actual y actualizará la configuración del gestor de arranque.
pt: Tem a certeza de que quer ativar o kernel {}? Isto irá desativar o kernel atual e atualizar a configuração do carregador de arranque.

source: Activating kernel, please wait...
es: Activando kernel, por favor espere...
pt: A ativar o kernel, por favor aguarde...

source: Please select a kernel to delete
es: Por favor, seleccione un kernel para eliminar
pt: Por favor, selecione um kernel para apagar

source: Delete Kernel
es: Eliminar Kernel
pt: Apagar Kernel

source: Are you sure you want to delete kernel '{}'? This action cannot be undone.
es: ¿Está seguro de que desea eliminar el kernel '{}'? Esta acción no se puede deshacer.
pt: Tem a certeza de que quer apagar o kernel '{}'? Esta ação não pode ser desfeita.

source: Select Kernel Package
es: Seleccionar Paquete de Kernel
pt: Selecionar Pacote do Kernel

source: Cancel
es: Cancelar
pt: Cancelar

source: Open
es: Abrir
pt: Abrir

source: Debian Package Files (*.deb)
es: Archivos de paquete Debian (*.deb)
pt: Ficheiros de Pacotes Debian (*.deb)

source: All Files
es: Todos los Archivos
pt: Todos os Ficheiros

source: Fetching kernel list from repository...
es: Obteniendo lista de kernels del repositorio...
pt: A obter a lista de kernels do repositório...

source: Scanning for manual packages...
es: Escaneando paquetes manuales...
pt: A procurar pacotes manuais...

source: Manual package
es: Paquete manual
pt: Pacote manual

source: Repository kernel
es: Kernel del repositorio
pt: Kernel do repositório

source: Package database outdated
es: Base de datos de paquetes desactualizada
pt: Banco de dados de pacotes desatualizado

source: The repository kernel list is empty. This may indicate an outdated package database. Update package lists now?
es: La lista de kernels del repositorio está vacía. Esto puede indicar una base de datos de paquetes desactualizada. ¿Actualizar listas de paquetes ahora?
pt: A lista de kernels do repositório está vazia. Isso pode indicar um banco de dados de pacotes desatualizado. Atualizar listas de pacotes agora?

source: Failed to update package lists
es: Error al actualizar las listas de paquetes
pt: Falha ao atualizar as listas de pacotes

source: No repository kernels found
es: No se encontraron kernels en el repositorio
pt: Nenhum kernel de repositório encontrado

source: No manual packages found
es: No se encontraron paquetes manuales
pt: Nenhum pacote manual encontrado

source: Failed to fetch repository kernels
pt: Falha ao obter kernels do repositório

source: Executing command: {}
es: Ejecutando comando: {}
pt: A executar comando: {}

source: Failed to start packaging process. Please check the log for detailed error information.
es: No se pudo iniciar el proceso de empaquetado. Por favor, revise el registro para obtener información detallada del error.
pt: Falha ao iniciar o processo de empacotamento. Por favor, verifique o registo para obter informações detalhadas sobre o erro.

source: CLI tool finished successfully, installing to repository...
es: Herramienta CLI finalizada con éxito, instalando en el repositorio...
pt: Ferramenta CLI concluída com sucesso, a instalar no repositório...

source: Installing kernel to repository...
es: Instalando kernel en el repositorio...
pt: A instalar o kernel no repositório...

source: CLI tool finished successfully.
es: Herramienta CLI finalizada con éxito.
pt: Ferramenta CLI concluída com sucesso.

source: Kernel packaging failed with exit code: {}
es: El empaquetado del kernel falló con el código de salida: {}
pt: O empacotamento do kernel falhou com o código de saída: {}

source: Kernel packaging failed with exit code: {}. Please check the log above for detailed error information.
es: El empaquetado del kernel falló con el código de salida: {}. Por favor, revise el registro anterior para obtener información detallada del error.
pt: O empacotamento do kernel falhou com o código de saída: {}. Por favor, verifique o registo acima para obter informações detalhadas sobre o erro.

source: Starting packaging process...
es: Iniciando proceso de empaquetado...
pt: A iniciar o processo de empacotamento...

source: Packaging Log
es: Registro de Empaquetado
pt: Registo de Empacotamento

source: Cancelling and cleaning up...
es: Cancelando y limpiando...
pt: A cancelar e a limpar...

source: Back to Selection
es: Volver a la Selección
pt: Voltar à Seleção

source: Cancelling packaging...
es: Cancelando empaquetado...
pt: A cancelar o empacotamento...

source: Error
pt: Erro

source: Packaging Complete
es: Empaquetado Completo
pt: Empacotamento Concluído

source: The new kernel is now available in the 'Manage Kernels' tab.
es: El nuevo kernel ya está disponible en la pestaña 'Administrar Kernels'.
pt: O novo kernel está agora disponível na aba 'Gerir Kernels'.

source: Custom temporary directory does not exist: {}
es: El directorio temporal personalizado no existe: {}
pt: A pasta temporária personalizada não existe: {}

source: Custom temporary directory is not writable: {}
es: El directorio temporal personalizado no es escribible: {}
pt: A pasta temporária personalizada não é gravável: {}

source: Using custom temporary directory for {operation} ({available:.1f}MB available, {needed:.1f}MB needed)
es: Usando directorio temporal personalizado para {operation} ({available:.1f}MB disponibles, {needed:.1f}MB necesarios)
pt: A utilizar a pasta temporária personalizada para {operation} ({available:.1f}MB disponíveis, {needed:.1f}MB necessários)

source: Insufficient space in custom temporary directory '{}' for {}: {:.1f}MB available, {:.1f}MB needed
es: Espacio insuficiente en el directorio temporal personalizado '{}' para {}: {:.1f}MB disponibles, {:.1f}MB necesarios
pt: Espaço insuficiente na pasta temporária personalizada '{}' para {}: {:.1f}MB disponíveis, {:.1f}MB necessários

source: Cannot check space in custom temporary directory '{}': {}
es: No se puede verificar el espacio en el directorio temporal personalizado '{}': {}
pt: Não foi possível verificar o espaço na pasta temporária personalizada '{}': {}

source: Using /tmp for {operation} ({available:.1f}MB available, {needed:.1f}MB needed)
es: Usando /tmp para {operation} ({available:.1f}MB disponibles, {needed:.1f}MB necesarios)
pt: A utilizar /tmp para {operation} ({available:.1f}MB disponíveis, {needed:.1f}MB necessários)

source: Insufficient space in /tmp for {operation} ({available:.1f}MB available, {needed:.1f}MB needed)
es: Espacio insuficiente en /tmp para {operation} ({available:.1f}MB disponibles, {needed:.1f}MB necesarios)
pt: Espaço insuficiente em /tmp para {operation} ({available:.1f}MB disponíveis, {needed:.1f}MB necessários)

source: Detected {} filesystem, using alternative: {}
es: Sistema de archivos {} detectado, usando alternativa: {}
pt: Sistema de ficheiros {} detetado, a utilizar alternativa: {}

source: Created alternative temporary directory: {}
es: Directorio temporal alternativo creado: {}
pt: Pasta temporária alternativa criada: {}

source: Using alternative temporary directory: {} ({:.1f}MB available)
es: Usando directorio temporal alternativo: {} ({:.1f}MB disponibles)
pt: A utilizar pasta temporária alternativa: {} ({:.1f}MB disponíveis)

source: Insufficient disk space for operation. Need {:.1f}MB, but only {:.1f}MB available in /tmp and {:.1f}MB in {}
es: Espacio en disco insuficiente para la operación. Se necesitan {:.1f}MB, pero solo {:.1f}MB disponibles en /tmp y {:.1f}MB en {}
pt: Espaço em disco insuficiente para a operação. Necessário {:.1f}MB, mas apenas {:.1f}MB disponíveis em /tmp e {:.1f}MB em {}

source: Could not check disk space: {}. Using default temporary directory.
es: No se pudo verificar el espacio en disco: {}. Usando el directorio temporal predeterminado.
pt: Não foi possível verificar o espaço em disco: {}. A utilizar a pasta temporária predefinida.
